# Mod10 DataFrame Indexing and Selection

## Data Selection in DataFrame

### DataFrame as a dictionary

In [1]:
import numpy as np
import pandas as pd

In [2]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [3]:
data['area'] #dictionary-style indexing

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [4]:
data.area #attribute-style access

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

This attribute-style column access actually accesses the exact same object as the dictionary-style access:

In [5]:
data.area is data['area']

True

the ``DataFrame`` has a ``pop()`` method, so ``data.pop`` will point to this rather than the ``"pop"`` column:

In [6]:
data.pop is data['pop']

False

adding a new column:

In [7]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

### DataFrame as two-dimensional array
<details>
    <summary><b>dataframe結構圖</b></summary>
    <img src='./img/creating_dataframe1.png'>
</details>

In [8]:
data.columns

Index(['area', 'pop', 'density'], dtype='object')

In [9]:
data.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [10]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

transpose the full ``DataFrame`` to swap rows and columns:

In [11]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

passing a single index to an array accesses a row:

In [12]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

passing a single "index" to a ``DataFrame`` accesses a column:

In [13]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

acess mutiple columns(like fancy index)

In [14]:
data[['area','pop']]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [15]:
data['Florida':'Illinois'] # slicing rows

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

Such slices can also refer to rows by number rather than by index:

In [16]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

Similarly, direct masking operations are also interpreted row-wise rather than column-wise:

In [17]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [18]:
data[(data['pop'] > 20000000) & (data['area'] > 500000)]

         area       pop   density
Texas  695662  26448193  38.01874

Using the iloc indexer, the ``DataFrame`` index and column labels are maintained in the result:

In [19]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [20]:
data.iloc[1,2]

38.01874042279153

In [21]:
data.iloc[0]

area       4.239670e+05
pop        3.833252e+07
density    9.041393e+01
Name: California, dtype: float64

In [22]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

Using the ``loc`` indexer we can index the underlying data using the explicit index and column names:

In [23]:
data.loc['Texas']

area       6.956620e+05
pop        2.644819e+07
density    3.801874e+01
Name: Texas, dtype: float64

In [24]:
data.loc['Illinois', 'pop']

12882135

In [25]:
data.loc[:'Texas', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193

combine masking and fancy indexing as in the following:

In [26]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [27]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [28]:
data.loc[data.density > 100, 'pop':'density']

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

to set or modify values

In [29]:
data.iloc[0, 2] = 90
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

Access a single value for a row/column pair

In [30]:
data.at['Texas','area']

695662

In [31]:
data.loc['Texas','area']

695662

In [32]:
data.iat[4,0]

149995

In [33]:
data.iloc[4,0]

149995

<details>
    <summary><b>dataframe結構圖</b></summary>
    <img src='./img/creating_dataframe1.png'>
</details>
<details>
    <summary><b>dataframe的Series結構圖</b></summary>
    <details>
        <summary><b>columns' series </b></summary>
        <img src='./img/dataSER-1.png'>
    </details>
    <details>
        <summary><b>index lables' series </b></summary>
        <img src='./img/dataSER-2.png'>
    </details>
</details>

## Lab

<b>有一個 DataFrame df，取得如下的資料:
* 'two' 整欄的資料
* 'three' 與 'one' 這兩欄的資料
</b>

In [34]:
np.random.seed(51)
df = pd.DataFrame(np.random.randint(11,70,size=20).reshape((4, 5)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four', 'five'])
df

          one  two  three  four  five
Ohio       68   48     43    20    16
Colorado   27   32     41    63    52
Utah       48   69     57    48    41
New York   39   31     47    46    38

<b>透過 loc 以及 iloc 取得 'three' 與 'one' 這兩欄的 'Ohio' 與 'Utah' 的資料</b>

<b>透過 at 以及 iat 取得 'Utah' 的 'three' 的資料</b>